# Olivia Storaci
## Week 13: 04/12/2022
### Python - Pandas Series and DataFrame
#### Panda allows us to analyze data and visualize it. High efficiency and very simple. Use it for data cleansing. Plot the data and do statistical analysis. You can also do indexing. Can take in many types of files that can be reformatted and analyzed. Even live streaming data such as stocks, weather, or traffic, etc. Import and read. Connect tables and the group by function that changes

In [1]:
# Multiple Imports at the beginning. Import as different forms. 
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [2]:
mydataset = {

    'cars':["GMC", "Toyota", "Ford"],
    'seats':[8,7,5]
    
}

df1 = pd.DataFrame(mydataset)
print(df1)

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [3]:
# That is the data type
type(df1)

pandas.core.frame.DataFrame

In [4]:
# That is a double underscore for some reason lol
print(pd.__version__)

1.0.5

In [5]:
# Panda Series. Shows the Index
s = Series([2,5,7,-9,8,4])
s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [6]:
print(s)

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [7]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [8]:
# Automatically returned
s.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
# S at index 1
s[1]

5

In [11]:
# S at index 4
s[4]

8

In [13]:
# Create Labels
s = pd.Series([10,20,30,40], index = ["w","x","y","z"])
print(s)

w    10
x    20
y    30
z    40
dtype: int64

In [14]:
s["y"]

30

In [15]:
type(s)

pandas.core.series.Series

In [17]:
# Creating series from numpy array. Specify the labels for the rows. 
data = np.array(['a','b','c','d'])
s = Series(data, index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [21]:
# vallues and indicies
summer_olympics=Series([2520,1122,937,847,713], index=['USA','Russia','Germany','UK','France'])
summer_olympics

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [22]:
'USA' in summer_olympics

True

In [24]:
# Convert Series to Dictionary
summer_olympics_dict = summer_olympics.to_dict()
summer_olympics_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [26]:
# How to query data in the dictionary
summer_olympics_dict['UK']

847

In [27]:
# Convert Dictionay to Series. See that it is back. 
summer_olympic_series = Series(summer_olympics_dict)
summer_olympic_series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [28]:
countries = ['Russia','France','Spain','Germany','USA','UK','Italy']

In [29]:
# Redefine a Series. Merge dictionary with list inside. No data for Spain & Italy
s2 = Series(summer_olympics_dict,index=countries)
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [30]:
# What are the missing data points. How to find where null is. If true the data 'isnull'
pd.isnull(s2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [31]:
# Tells you the countries that do have the data.
pd.notnull(s2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [32]:
summer_olympic_series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [33]:
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [34]:
# Add the Data
summer_olympic_series + s2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [35]:
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [36]:
# Not a variable name - but a property
s.name="Summer Olympic"
s

100    a
101    b
102    c
103    d
Name: Summer Olympic, dtype: object

In [38]:
# Add the index name - in a spreadsheet etc. 
s2.index.name="Countries"
s2

Countries
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [42]:
# Creating Dataframe = 2D data structure with rows and columns. Can change by grouping data
# Create a simple Pandas Dataframe
data = {
    "Calories":[420,380,390],
    "Fruits":['Orange','Banana','Grape']
}

# Load data into a Dataframe Object: 
df=DataFrame(data)
df

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [43]:
# Locate Row using Pandas Loc Attribute / property\
# Give me ROW 0
df.loc[0]

Calories       420
Fruits      Orange
Name: 0, dtype: object

In [44]:
d = df.loc[1]
d

Calories       380
Fruits      Banana
Name: 1, dtype: object

In [45]:
type(d)

pandas.core.series.Series

In [46]:
# Show two Rows
df.loc[[0,1]]

   Calories  Fruits
0       420  Orange
1       380  Banana

In [47]:
type(d)

pandas.core.series.Series

In [49]:
# Data Frame
data_dict = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
             'year': [2000,2001,2002,2001,2002,2003],
             'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}

df = pd.DataFrame(data_dict)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [56]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [71]:
# Reorder the columns
DataFrame(data_dict, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [72]:
df2 = pd.DataFrame(data_dict, columns=['year','state','pop','debt'],
                  index=['One','Two','Three','Four','Five','Six'])
df2

       year   state  pop debt
One    2000    Ohio  1.5  NaN
Two    2001    Ohio  1.7  NaN
Three  2002    Ohio  3.6  NaN
Four   2001  Nevada  2.4  NaN
Five   2002  Nevada  2.9  NaN
Six    2003  Nevada  3.2  NaN

In [73]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [77]:
df2['state']

One        Ohio
Two        Ohio
Three      Ohio
Four     Nevada
Five     Nevada
Six      Nevada
Name: state, dtype: object

In [78]:
df2.state

One        Ohio
Two        Ohio
Three      Ohio
Four     Nevada
Five     Nevada
Six      Nevada
Name: state, dtype: object

In [79]:
df2.year

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Six      2003
Name: year, dtype: int64

In [80]:
df2['year']

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Six      2003
Name: year, dtype: int64

In [82]:
df2.loc['One']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: One, dtype: object

In [84]:
# Add values to the column
df2['debt'] = 10.5
df2

       year   state  pop  debt
One    2000    Ohio  1.5  10.5
Two    2001    Ohio  1.7  10.5
Three  2002    Ohio  3.6  10.5
Four   2001  Nevada  2.4  10.5
Five   2002  Nevada  2.9  10.5
Six    2003  Nevada  3.2  10.5

In [87]:
# add a range
df2['debt']=np.arange(6.)
df2

       year   state  pop  debt
One    2000    Ohio  1.5   0.0
Two    2001    Ohio  1.7   1.0
Three  2002    Ohio  3.6   2.0
Four   2001  Nevada  2.4   3.0
Five   2002  Nevada  2.9   4.0
Six    2003  Nevada  3.2   5.0

In [88]:
# Generate Random Data assign them to the necessary column
df2['debt']=np.random.randn(6)
df2

       year   state  pop      debt
One    2000    Ohio  1.5  0.388220
Two    2001    Ohio  1.7  0.147766
Three  2002    Ohio  3.6  0.684841
Four   2001  Nevada  2.4 -0.852296
Five   2002  Nevada  2.9 -1.066070
Six    2003  Nevada  3.2 -0.392272

In [94]:
# Assign a Series values to pandas data frame

s3 = pd.Series([-1.2,-1.5,-1.7], index=['Two','Four','Five'])
s3

Two    -1.2
Four   -1.5
Five   -1.7
dtype: float64

In [95]:
df2['debt']=s3

In [96]:
df2

       year   state  pop  debt
One    2000    Ohio  1.5   NaN
Two    2001    Ohio  1.7  -1.2
Three  2002    Ohio  3.6   NaN
Four   2001  Nevada  2.4  -1.5
Five   2002  Nevada  2.9  -1.7
Six    2003  Nevada  3.2   NaN

In [98]:
# Add a new column to the Dataframe. Locate the important information and create column based on this
df2['eastren']=df2['state'] == 'Ohio'

In [99]:
df2

       year   state  pop  debt  eastren
One    2000    Ohio  1.5   NaN     True
Two    2001    Ohio  1.7  -1.2     True
Three  2002    Ohio  3.6   NaN     True
Four   2001  Nevada  2.4  -1.5    False
Five   2002  Nevada  2.9  -1.7    False
Six    2003  Nevada  3.2   NaN    False

In [100]:
# Object because it has different data types
df2.columns

Index(['year', 'state', 'pop', 'debt', 'eastren'], dtype='object')

In [101]:
# Remove a column / delete it
del df2['eastren']

In [102]:
# Now the column is gone
df2

       year   state  pop  debt
One    2000    Ohio  1.5   NaN
Two    2001    Ohio  1.7  -1.2
Three  2002    Ohio  3.6   NaN
Four   2001  Nevada  2.4  -1.5
Five   2002  Nevada  2.9  -1.7
Six    2003  Nevada  3.2   NaN

In [104]:
# Create a DataFrame from a Nested Dictionary
# Using nested dictionary to create a data frame
pop_dict={'Nevada': {2001:2.4,2002:2.9},
         'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}

pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [105]:
# Create Table from the Dictionary. Very cool. 
df3 = DataFrame(pop_dict)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [106]:
df3.T # Changing rows to columns

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [107]:
# Shows that the above is not permanent
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [108]:
# Shows that 2003 has not data unlike 2001 and 2002
DataFrame(df3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [109]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [110]:
# Can return certain number of rows
df3['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [112]:
# Gives you row 0 and 1 but row 2 is the exit row. Misses 2000 row
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [113]:
# Exclude the last row
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [114]:
# Gives you the Nevade row 1
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [115]:
# Shows you what the rows and columns are made up of
df3.index.name = 'year';df3.columns.name = 'states'
df3

states  Nevada  Ohio
year
2001       2.4   1.7
2002       2.9   3.6
2000       NaN   1.5